/*
  Написать следующий скрипт:
  
    - При загрузке страницы пользователю предлагается ввести через prompt число. 
      Число введенное пользователем записывается в массив чисел.
      
    - Операция ввода числа пользователем и сохранение в массив продолжается до
      тех пор, пока пользователь не нажмет Cancel в prompt. Используйте цикл do...while.
      
    - После того как пользователь прекратил ввод нажав Cancel, необходимо взять 
      массив введенных чисел, сложить общую сумму всех элементов массива и 
      записать ее в переменную. Используйте цикл for...of.
      
    - По окончанию ввода, если массив не пустой, вывести alert с текстом `Общая сумма чисел равна ${сумма}`
      
  🔔 PS: Делать проверку того, что пользователь ввел именно число, а не произвольный набор 
      символов, не обязательно. Если хотите, в случае некорректного ввода покажите alert с текстом 
      'Было введено не число, попробуйте еще раз', при этом результат prompt записывать 
      в массив чисел не нужно, после чего снова пользователю предлагается ввести число в prompt.
*/
"use strict"
let userInput = 0;
const numbers = [];
let total = 0;

do {
    userInput = Number(prompt("Введите числа для получения их суммы. Для окончания ввода нажмите Cancel", " "));
    if (userInput) {
        numbers.push(userInput);
    } else if (!userInput && userInput !== 0) {
        alert('Было введено не число, попробуйте еще раз');
    }
} while (userInput !== 0);

numbers.pop(userInput);

// for(i = 0; i < numbers.length; i += 1){
//   total += numbers[i];
// }

for (let i of numbers) {
    total += i;
}
if (numbers.length >= 1) {
    alert(`Вы ввели следующие цифры для суммирования: ${numbers}`);
    alert(`Общая сумма чисел равна: ${total}`);
}

console.log("Inputed array is: " + numbers);
console.log(`Общая сумма чисел равна: ${total}`);